In [1]:
import pandas as pd

In [9]:
df = {"Apples":[15,37,19,17,20],
     "Bananas":[16,23,18,10,11],
      "Grepes":[42,37,24,21,13]}

# Set index using any value

In [12]:
x = pd.DataFrame(df,index = ["India","China","Pakistan","America","Japan"])

In [13]:
x

          Apples  Bananas  Grepes
India         15       16      42
China         37       23      37
Pakistan      19       18      24
America       17       10      21
Japan         20       11      13

# To see uppen rows
#### I see 2 upper rows

In [14]:
x.head(2)

       Apples  Bananas  Grepes
India      15       16      42
China      37       23      37

# To see lower rows
#### I see 3 lower rows

In [15]:
x.tail(3)

          Apples  Bananas  Grepes
Pakistan      19       18      24
America       17       10      21
Japan         20       11      13

In [16]:
x

          Apples  Bananas  Grepes
India         15       16      42
China         37       23      37
Pakistan      19       18      24
America       17       10      21
Japan         20       11      13

### Max value in Apples column

In [18]:
x["Apples"].max()

37

### Max value index in Apples column

In [19]:
x["Apples"].argmax()

1

### Min value in Apples column

In [20]:
x["Apples"].min()

15

### Min value index in Apples column

In [21]:
x["Apples"].argmin()

0

In [22]:
x

          Apples  Bananas  Grepes
India         15       16      42
China         37       23      37
Pakistan      19       18      24
America       17       10      21
Japan         20       11      13

# Removing row using index value

In [23]:
x.drop("Pakistan")

         Apples  Bananas  Grepes
India        15       16      42
China        37       23      37
America      17       10      21
Japan        20       11      13

# Removing column using column name

In [26]:
x.drop("Grepes",axis = 1)

          Apples  Bananas
India         15       16
China         37       23
Pakistan      19       18
America       17       10
Japan         20       11

# Check how many types of items in your column

In [27]:
x["Apples"].unique()

array([15, 37, 19, 17, 20], dtype=int64)